Autodesk.Revit.DB.ConnectorManager.Lookup(System.Int32)
Lookup the connector using the unique index value that identify this connector.
index:
The unique index value.
Returns:
Returns the connector or null if a connector for the provided unique index value doesn't exist.
Since:
2016

Autodesk.Revit.DB.ConnectorManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ConnectorManager.Owner
This property is used to retrieve the owner of the Connector Manager.

Autodesk.Revit.DB.ConnectorManager.UnusedConnectors
Return all the unused Connectors of the Connector Manager.
Remarks: This property is used to retrieve the unused Connectors from the Connector Manager.

Autodesk.Revit.DB.ConnectorManager.Connectors
Return all the Connectors of the Connector Manager.
Remarks: This property is used to retrieve the Connectors from the Connector Manager.

Autodesk.Revit.DB.ConnectorManager
Provides access to the Connector Manager